# Напишите сценарий, который находил бы корни "квадратного " уравнения, вида: Ax^2 + Bx + C = 0. Сценарий должен получать коэффициенты уравнения A, B и C, как аргументы командной строки, и выводить корни. Если корней нет, вывод должен быть пустым.

#!/bin/bash

# if [ $# -ne 3 ]; then
#     echo "Ошибка: Заданы не все параметры" >&2
#     exit 1
# fi

# re='^[+-]?[0-9]+([.][0-9]+)?$'
# for coef in "$@"; do
#     if ! [[ $coef =~ $re ]]; then
#         echo "Ошибка: Коэффициент $coef не является числом" >&2
#         exit 1
#     fi
# done

# a=$1
# b=$2
# c=$3

# D=$(bc -l <<< "$b^2 - 4*$a*$c")

# echo "D = $D"
# echo "Ответ:"

# if (( $(bc -l <<< "$D < 0") )); then
#     echo "нет решения"
# elif (( $(bc -l <<< "$D == 0") )); then
#     x1x2=$(bc -l <<< "(-1)*$b/(2*$a)")
#     echo "x1 = x2 = $x1x2"
# else
#     x1=$(bc -l <<< "(-1)*$b+sqrt($D)/(2*$a)")
#     x2=$(bc -l <<< "(-1)*$b-sqrt($D)/(2*$a)")
#     echo "x1 = $x1"
#     echo "x2 = $x2"
# fi
